OpenFOAM-v1712/tutorials/lagrangian/reactingParcelFoam/filter/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

method          scotch;

preserveFaceZones
(
    cycLeft
    cycRight
);

coeffs
{
    n           (2 2 1);
    //delta       0.001; // default=0.001
    //order       xyz;   // default=xzy
    dataFile    "";
}

// ************************************************************************* //
